## 라이브러리

In [1]:
import numpy as np
import pandas as pd

## 데이터 불러오기

In [15]:
#데이터 로드
x_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_train.csv")
y_train = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/y_train.csv")
x_test= pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/X_test.csv")
y_test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/HRdata/y_test.csv')

display(x_train.head())
display(x_test.head())
display(y_train.head())

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,25298,city_138,0.836,Male,No relevent experience,Full time course,High School,NaN,5,100-500,Pvt Ltd,1,45
1,4241,city_160,0.920,Male,No relevent experience,Full time course,High School,NaN,5,NaN,NaN,1,17
2,24086,city_57,0.866,Male,No relevent experience,no_enrollment,Graduate,STEM,10,NaN,NaN,1,50
3,26773,city_16,0.910,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,>4,135
4,32325,city_143,0.740,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,17

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,7129,city_23,0.899,Male,No relevent experience,no_enrollment,Graduate,STEM,2,NaN,NaN,1,23
1,31037,city_44,0.725,Male,No relevent experience,Part time course,Masters,STEM,5,NaN,NaN,never,39
2,22179,city_103,0.920,Male,No relevent experience,Full time course,Graduate,STEM,7,NaN,NaN,2,262
3,29724,city_50,0.896,Male,No relevent experience,Full time course,Graduate,STEM,7,NaN,NaN,never,78
4,17977,city_149,0.689,Female,Has relevent experience,Full time course,Masters,STEM,19,50-99,Pvt Ltd,1,125

   enrollee_id  target
0        25298     0.0
1         4241     1.0
2        24086     0.0
3        26773     0.0
4        32325     1.0

## EDA

In [16]:
print(x_train.info())
print(y_test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12452 entries, 0 to 12451
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   enrollee_id             12452 non-null  int64
 1   city                    12452 non-null  object
 2   city_development_index  12452 non-null  float64
 3   gender                  9535 non-null   object
 4   relevent_experience     12452 non-null  object
 5   enrolled_university     12195 non-null  object
 6   education_level         12137 non-null  object
 7   major_discipline        10586 non-null  object
 8   experience              12415 non-null  object
 9   company_size            8600 non-null   object
 10  company_type            8471 non-null   object
 11  last_new_job            12179 non-null  object
 12  training_hours          12452 non-null  int64
dtypes: float64(1), int64(2), object(10)
memory usage: 1.2+ MB
None
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6706 entries, 0 to 6705
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   enrollee_id  6706 non-null   int64
 1   target       6706 non-null   float64
dtypes: float64(1), int64(1)
memory usage: 104.9 KB
None

In [25]:
print(x_train.isna().sum())
print('-'*100)
print(x_test.isna().sum())

enrollee_id                  0
city                         0
city_development_index       0
gender                    2917
relevent_experience          0
enrolled_university        257
education_level            315
major_discipline          1866
experience                  37
company_size              3852
company_type              3981
last_new_job               273
training_hours               0
dtype: int64
----------------------------------------------------------------------------------------------------
enrollee_id                  0
city                         0
city_development_index       0
gender                    1591
relevent_experience          0
enrolled_university        129
education_level            145
major_discipline           947
experience                  28
company_size              2086
company_type              2159
last_new_job               150
training_hours               0
dtype: int64

### 결측치 처리

In [ ]:
# gender

In [17]:
# enrollee_id는 모델학습에 필요없으므로 파일 저장을 위해 따로 Series로 저장
id = x_test['enrollee_id']

In [18]:
# 데이터 형태
print(x_train.shape, x_test.shape, y_train.shape)

(12452, 13) (6706, 13) (12452, 2)

In [21]:
# x에 같은 처리를 하기 위해 합쳐서 처리
dfX = pd.concat([x_train, x_test])

# x, y enrollee_id drop
dfX.drop(columns=['enrollee_id'], inplace=True)
# y_train.drop(columns=['enrollee_id'], inplace=True)

# dfX에서 수치형 데이터로 변경하기(city, gender, relevent_experience ,enrolled_university, education_level, major_discipline, experience, company_size, company_type, last_new_job)
lst = ['city', 'gender', 'relevent_experience' ,'enrolled_university', 'education_level', 'major_discipline', 'experience', 'company_size', 'company_type', 'last_new_job']
for i in lst:
    dfX[i] = dfX[i].astype('category').cat.codes

display(dfX.head())
print(dfX.info())

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,31,0.836,1,1,0,1,-1,15,1,5,0,45
1,49,0.920,1,1,0,1,-1,15,-1,-1,0,17
2,89,0.866,1,1,2,0,5,1,-1,-1,0,50
3,48,0.910,1,0,2,0,5,21,4,5,4,135
4,37,0.740,-1,1,0,0,5,15,-1,-1,5,17

<class 'pandas.core.frame.DataFrame'>
Index: 19158 entries, 0 to 6705
Data columns (total 12 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   city                    19158 non-null  int8
 1   city_development_index  19158 non-null  float64
 2   gender                  19158 non-null  int8
 3   relevent_experience     19158 non-null  int8
 4   enrolled_university     19158 non-null  int8
 5   education_level         19158 non-null  int8
 6   major_discipline        19158 non-null  int8
 7   experience              19158 non-null  int8
 8   company_size            19158 non-null  int8
 9   company_type            19158 non-null  int8
 10  last_new_job            19158 non-null  int8
 11  training_hours          19158 non-null  int64
dtypes: float64(1), int64(1), int8(10)
memory usage: 636.1 KB
None

## 모델링

###

###